{"data":{"markdownRemark":{"html":"<h1>Getting started with React.js</h1>\n<p>I've mentioned previously that the best way to learn react is to:</p>\n<ol>\n<li>Scaffold a project and build something simple</li>\n<li>Read the React docs all the way through</li>\n</ol>\n<p>For designers with an understanding of web development, this advice is fine. But it assumes you are comfortable opening your terminal, navigating to a location, installing a global node module, and understanding javascript.</p>\n<p>If you are going from zero development experience to using React as a designer there are a number of prerequisites that need to be in place.</p>\n<h2>Prerequisites</h2>\n<h3>1. Terminal</h3>\n<p>Don't let the terminal scare you away. It's just a tool to navigate your file system, similar to Finder. After you've added a nice theme, there are a few commands you should learn.  </p>\n<table>\n<thead>\n<tr>\n<th></th>\n<th></th>\n<th></th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>ls</td>\n<td>cd</td>\n<td>mv</td>\n<td>touch</td>\n</tr>\n<tr>\n<td>mkdir</td>\n<td>rm</td>\n<td>open</td>\n<td></td>\n</tr>\n</tbody>\n</table>\n<p>It's good to know how your file system is set up.\n<code>/ ← shorthand for your root directory</code>\n<code>~ ← shorthand for your user directory</code></p>\n<p>Once you are comfortable viewing and moving around the file system, creating and deleting files and folders launching applications, you can install node, and yarn. </p>\n<p>You will use Yarn to add modules to your react project, and install React project scaffolding tools.</p>\n<p>If you are on a Mac you can run the following command.\n<code>brew install yarn</code>\nThis will install yarn, and node if it's not already installed.</p>\n<h3>2. HTML</h3>\n<p>React uses a templating language called JSX which looks similar to HTML but is actually JavaScript. In order to use it you should have some understanding of HTML.</p>\n<h4>Elements</h4>\n<table>\n<thead>\n<tr>\n<th></th>\n<th></th>\n<th></th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>&#x3C;h1></td>\n<td>&#x3C;p></td>\n<td>&#x3C;a></td>\n<td>&#x3C;input /></td>\n</tr>\n<tr>\n<td>&#x3C;div></td>\n<td>&#x3C;script></td>\n<td>&#x3C;body></td>\n<td>&#x3C;link /></td>\n</tr>\n</tbody>\n</table>\n<h4>Attributes</h4>\n<table>\n<thead>\n<tr>\n<th></th>\n<th></th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>class</td>\n<td>id</td>\n<td>href</td>\n</tr>\n</tbody>\n</table>\n<h3>3. CSS</h3>\n<p>CSS is one of the ways you'll be designing in the browser. You've probably wanted your designs implemented looking the way they were designed. CSS is your friend, and you can learn the basics on MDN. Learning the CSS syntax, selectors, color properties, display, box-model, and basic positioning will provide a good foundation. You may decide you'd prefer to write styles in JavaScript, but you'll need a foundational understanding of CSS none the less.</p>\n<h4>Selectors</h4>\n<table>\n<thead>\n<tr>\n<th></th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>.class</td>\n<td>#id</td>\n</tr>\n<tr>\n<td>element</td>\n<td>pseudo-selectors</td>\n</tr>\n</tbody>\n</table>\n<h4>Properties</h4>\n<ul>\n<li>color &#x26; background color</li>\n<li>margin &#x26; padding</li>\n<li>border</li>\n<li>display</li>\n<li>width &#x26; height</li>\n<li>position</li>\n<li>box-model</li>\n<li>border-radius</li>\n<li>z-index</li>\n<li>opacity</li>\n</ul>\n<h3>4. JavaScript</h3>\n<p>You don't need to be an expert, but having some understanding of JavaScript and familiarity with the modern syntax will go a long way. MDN has really good JavaScript resources,\n<a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript\">https://developer.mozilla.org/en-US/docs/Web/JavaScript</a></p>\n<h4>Important Concepts</h4>\n<ul>\n<li>variables</li>\n<li>data structures</li>\n<li>loops</li>\n<li>conditionals</li>\n<li>functions</li>\n</ul>\n<p>If you know some of these things, but aren't sure if you know enough I would jump into React. As you learn React you will improve your understanding of all these technologies. So much of React is writing vanilla JavaScript. Much of the styling in React is exactly the same as writing CSS. Much of the JSX is identical to HTML. Once you understand the underlying technologies which React is built on it, it is a lot easier to build interfaces.</p>\n<h2>Up and Running with a React App</h2>\n<p>When React was first introduced one of the biggest pain points was setting up the webpack configuration. Getting a project set up in a semi functional way took some time and understanding of how webpack worked. Developer ergonomics have improved even while lots of the underpinning technologies have remained. Tools that allow you to scaffold a project made designing in React a realistic possibility for me.</p>\n<p>Two tools I'd like to highlight are Create-react-app and NWB. These tools allow you run a command and have a scaffolded app up and running.</p>\n<p>Tools like Create-React-App enabled me to quickly spin up prototypes. That in conjunction with design component libraries enabled me to prototype interfaces in the same medium that they would be interfaces.</p>\n<p>If you've never used react before, I'd recommend installing create-react-app, scaffolding and app, poking around a bit to get comfortable with a few files, and then trying to build something very simple.</p>\n<p>I have node.js and yarn installed on my machine.\nLet's install Create-React-App.\n<code>yarn install create-react-app</code></p>\n<p>And then create a new scaffolded project\n<code>create-react-app first-react-project</code>\n(Note: You may want to change directory to a different location before creating a new project)</p>\n<p>Next, we'll go into the directory and install our node modules\n<code>cd first-react-project</code>\n<code>yarn install</code></p>\n<p>If we open up App.js in our project we can see we're importing components. React is all about components, so it's important to note that we can create components in other files and then import them into our project.</p>\n<p>If we look at our file system you can see that Create-React app has created the web pack file for us. If you make a change you'll see the changes show up in your browser without having to refresh the page, which is super useful when you're working with styles.</p>\n<p>Let's add a simple button component of your own.</p>\n<pre><code>&#x3C;button onClick(alert(\"you clicked me!\"))>\n    You can click me\n&#x3C;/button>\n</code></pre>\n<p>You may have a lot of questions as you open up the App.js file. Why are classes called className? What is this HTML like syntax for creating components? What are components?</p>\n<p>This is where the React.js documentation is really helpful.</p>\n<h2>Reading the Documentation</h2>\n<p>The React.js resources provided on the website are pure gold.</p>\n<p>Once you've poked around with React and built something small I recommend reading through the Main Concepts section of the docs and reading the rest quickly.</p>\n<p>It's a good idea to go through it all even though you won't need it all because you will have an idea of where to look when you get stuck.</p>","frontmatter":{"date":"April 08, 2019","path":"/getting-started","title":"Getting started with React.js"}}},"pageContext":{}}